# BuiltInFailures.SelectionFailures Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..SelectionFailures Properties
BuiltInFailures..::..SelectionFailures Class See Also
---
The BuiltInFailures..::..SelectionFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NoElementSelected | No element selected. |
| NoValidElementSelected | No valid element selected. |

# See Also
BuiltInFailures..::..SelectionFailures Class
Autodesk.Revit.DB Namespace